AirfoilThickness/thin/aoa20/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;
startFrom       latestTime; 
startTime       0;
stopAt          endTime;

// // PISO
// endTime         0.6;
// deltaT          0.001;
// writeControl    adjustableRunTime;
// writeInterval   0.1;
// maxCo       1;
// adjustTimeStep  yes;
// timePrecision   6;
// // PISO

// SIMPLE
endTime         20000;
deltaT          1;
writeInterval   100;
// SIMPLE

purgeWrite      0;
writeFormat     binary;
writePrecision  10;
writeCompression off;
timeFormat      general;
runTimeModifiable true;

//Added for force output.
libs
(
    "libforces.so"
);

functions
{
    wing
    {
        patches             (wing);
        CofR                (0 0 0);
        outputControl       timeStep;
        outputInterval	    1;
        type                forces;
        pName               p;
        UName               U;
        rhoName             rhoInf;
        rhoInf              1.18;
        log                 true;
    }
}



// ************************************************************************* //
