AirfoilThickness/thin/aoa20/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


5
(
front_and_back
{
    type            empty;
    physicalType    patch;
    nFaces          39704;
    startFace       29401;
}

tunnel
{
    type            slip;
    physicalType    patch;
    nFaces          120;
    startFace       69105;
}

outlet
{
    type            patch;
    physicalType    patch;
    nFaces          40;
    startFace       69225;
}

inlet
{
    type            patch;
    physicalType    patch;
    nFaces          40;
    startFace       69265;
}

wing
{
    type            wall;
    physicalType    patch;
    nFaces          554;
    startFace       69305;
}

)


// ************************************************************************* //
